OpenFOAM/OpenFOAM-7/tutorials/lagrangian/reactingParcelFoam/hotBoxes/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
