OpenFOAM/OpenFOAM-7/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-7;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1e-7;
    }

    "(region0_to.*)"
    {
        type            epsilonWallFunction;
        value           uniform 1e-07;
    }
}


// ************************************************************************* //
