OpenFOAM/OpenFOAM-7/tutorials/lagrangian/reactingParcelFoam/hotBoxes/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

cp -rf 0.orig 0

application=$(getApplication)

runApplication -s primaryRegion  decomposePar
runApplication -s wallFilmRegion decomposePar -region wallFilmRegion

runParallel $application

runApplication -s primaryRegion  reconstructPar
runApplication -s wallFilmRegion reconstructPar -region wallFilmRegion

#------------------------------------------------------------------------------
